# 医生

## 管理平台
<a href="http://www.cssmoban.com/cssthemes/7691.shtml">预览-基础数据-房源管理</a>  
患者列表和病历列表都可以采用如下图结构  
<img src="pics/doctor/列表.png">
其中支持多条件查找功能，例如查找各年龄段的患者，查找不同性别的患者，也可以查找单个患者，支持挂号时间段内查找患者；患者列表下各字段信息需要重新确定，另外支持点击患者用户名查看用户信息，操作栏支持删除患者（康复）、查看历史病历、填写病历功能；  
查看历史病历及填写病历需要参考管理员下的添加用户那样，出现弹窗查看；（页面暂无）

## 数据平台
<a href="http://www.cssmoban.com/cssthemes/7131.shtml">预览-表格</a>  
<a href="http://www.cssmoban.com/cssthemes/6828.shtml">预览-文件管理</a>  
<img src="pics/doctor/数据管理-3.png"><center>参考链接1</center>
<br><br><br>
<img src="pics/doctor/数据管理-4.png"><center>参考链接2</center>
参考链接2下的文件管理是理想效果，若实现不了，则以参考链接1下表格展示。具体实现的功能查看下图：
<img src="pics/doctor/数据管理-1.png">
其中包括，类型展示，文件夹、word、PDF等文件用不同图标展示，功能栏去除分享，操作按钮保留链接1的那种格式。
对于上述选择删除之后的文件，需要有回收站页面查看，回收站页面效果同文件查看一致，实现功能如图：  
<img src="pics/doctor/数据管理-2.png">
仍旧需要保证类型展示，操作按钮跟链接1一致。需要注意的是，文件查看页面有文件地址功能，位于左上角，注意。

## 医患交流
<a href="http://www.cssmoban.com/cssthemes/5598.shtml">预览-pages-messages</a>  
展示效果图如下：  
<img src="pics/doctor/医患交流-1.png">
其中，展示内容去除复选框，展示字段包括发布人，发布标题，所属类别（病情解答、经验共享），发布时间；列表展示提供条件筛选功能，例如针对类别筛选，针对时间段内的内容；提供搜索功能，搜索发布人，搜索标题内包含指定字段的帖子；点击一个帖子，进去之后查看帖子详细信息，可以看到别人的评论内容，以及设有空白框供自己评论用（暂无模板，需自己找）；保留+号用于提供发布帖子功能，包括选择帖子类别，写帖子标题，写帖子正文内容。
